Repository: KorolArbuz/VPN
Catalog: VPN/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# diagnostics.udp_control.category
source: Failure category
ru: Категория сбоя

# diagnostics.udp_control.connection_ready
source: UDP connection ready
ru: UDP-соединение готово

# diagnostics.udp_control.diagnostics
source: UDP control diagnostics
ru: Диагностика UDP control

# diagnostics.udp_control.duration
source: Duration
ru: Длительность

# diagnostics.udp_control.error.not_runtime_only
source: Start a DEBUG runtime-only tunnel before running the UDP control probe.
ru: Сначала запустите DEBUG runtime-only туннель.

# diagnostics.udp_control.error.provider_unavailable
source: UDP control probe provider is unavailable.
ru: Провайдер UDP control probe недоступен.

# diagnostics.udp_control.failed
source: UDP control probe failed.
ru: UDP control probe не пройден.

# diagnostics.udp_control.passed
source: UDP control probe passed.
ru: UDP control probe пройден.

# diagnostics.udp_control.path_status
source: Path status
ru: Статус пути

# diagnostics.udp_control.response_received
source: UDP response received
ru: UDP-ответ получен

# diagnostics.udp_control.response_validated
source: DNS header validated
ru: DNS-заголовок проверен

# diagnostics.udp_control.run
source: Run UDP Control Probe
ru: Запустить UDP control probe

# diagnostics.udp_control.started
source: UDP control started
ru: UDP control запущен

# diagnostics.udp_control.succeeded
source: UDP control succeeded
ru: UDP control успешен

# diagnostics.udp_control.supports_dns
source: Supports DNS
ru: Поддерживает DNS

# diagnostics.udp_control.supports_ipv4
source: Supports IPv4
ru: Поддерживает IPv4

# diagnostics.udp_control.supports_ipv6
source: Supports IPv6
ru: Поддерживает IPv6

# diagnostics.udp_control.uses_cellular
source: Uses cellular
ru: Использует cellular

# diagnostics.udp_control.uses_wifi
source: Uses Wi-Fi
ru: Использует Wi-Fi

# diagnostics.udp_control.uses_wired
source: Uses wired Ethernet
ru: Использует проводной Ethernet

# diagnostics.udp_control.warning
source: Checks generic UDP from the PacketTunnelExtension during runtime-only mode with one bounded DNS datagram. It does not use Xray, Tun2Socks, network settings, or packetFlow.
ru: Проверяет обычный UDP из PacketTunnelExtension в runtime-only режиме одним ограниченным DNS datagram. Не использует Xray, Tun2Socks, сетевые настройки или packetFlow.

# diagnostics.udp_control.write
source: UDP payload written
ru: UDP payload отправлен

# diagnostics.value.none
source: None
ru: Нет

# diagnostics.value.unknown
source: Unknown
ru: Неизвестно

# diagnostics.xray_lifecycle.builder
source: Xray builder
ru: Сборка Xray

# diagnostics.xray_lifecycle.category
source: Category
ru: Категория

# diagnostics.xray_lifecycle.diagnostics
source: Xray lifecycle smoke test
ru: Smoke test жизненного цикла Xray

# diagnostics.xray_lifecycle.error.no_profile
source: Select a supported Xray-backed profile before running the Xray lifecycle smoke test.
ru: Выберите поддерживаемый Xray-профиль перед запуском smoke test жизненного цикла Xray.

# diagnostics.xray_lifecycle.error.shared_container
source: Shared runtime storage is unavailable.
ru: Общее хранилище runtime недоступно.

# diagnostics.xray_lifecycle.error.unsupported_protocol
source: This smoke test supports only Xray-backed K3B4 profiles.
ru: Этот smoke test поддерживает только Xray-профили K3B4.

# diagnostics.xray_lifecycle.extension_reached
source: Extension reached
ru: Расширение достигнуто

# diagnostics.xray_lifecycle.failed
source: Xray lifecycle smoke test failed.
ru: Smoke test жизненного цикла Xray не пройден.

# diagnostics.xray_lifecycle.passed
source: Xray lifecycle smoke test passed.
ru: Smoke test жизненного цикла Xray пройден.

# diagnostics.xray_lifecycle.port_closed
source: Local port closed
ru: Локальный порт закрыт

# diagnostics.xray_lifecycle.protocol
source: Protocol
ru: Протокол

# diagnostics.xray_lifecycle.readiness_duration
source: Readiness duration
ru: Длительность готовности

# diagnostics.xray_lifecycle.rollback
source: Rollback
ru: Откат

# diagnostics.xray_lifecycle.run
source: Run Xray Lifecycle Smoke Test
ru: Запустить smoke test Xray

# diagnostics.xray_lifecycle.running_state
source: Running state observed
ru: Состояние запуска получено

# diagnostics.xray_lifecycle.runtime_config
source: Runtime configuration
ru: Runtime-конфигурация

# diagnostics.xray_lifecycle.runxray_invoked
source: runXray invoked
ru: runXray вызван

# diagnostics.xray_lifecycle.security
source: Security
ru: Защита

# diagnostics.xray_lifecycle.socks_greeting
source: SOCKS greeting accepted
ru: Приветствие SOCKS принято

# diagnostics.xray_lifecycle.socks_ready
source: SOCKS listener ready
ru: SOCKS слушатель готов

# diagnostics.xray_lifecycle.stage
source: Stage
ru: Этап

# diagnostics.xray_lifecycle.start_duration
source: Start duration
ru: Длительность запуска

# diagnostics.xray_lifecycle.stop_duration
source: Stop duration
ru: Длительность остановки

# diagnostics.xray_lifecycle.stopped_state
source: Stopped state observed
ru: Состояние остановки получено

# diagnostics.xray_lifecycle.stopxray_invoked
source: stopXray invoked
ru: stopXray вызван

# diagnostics.xray_lifecycle.testxray_passed
source: testXray passed
ru: testXray пройден

# diagnostics.xray_lifecycle.total_duration
source: Total duration
ru: Общая длительность

# diagnostics.xray_lifecycle.transport
source: Transport
ru: Транспорт

# diagnostics.xray_lifecycle.warning
source: Starts Xray briefly, checks only the loopback SOCKS listener, then stops it automatically. No VPN traffic is routed.
ru: Кратко запускает Xray, проверяет только локальный SOCKS слушатель и автоматически останавливает его. VPN-трафик не маршрутизируется.

# diagnostics.xray_remote_egress.builder
source: Xray configuration built
ru: Конфигурация Xray собрана

# diagnostics.xray_remote_egress.cleanup
source: Cleanup succeeded
ru: Очистка выполнена

# diagnostics.xray_remote_egress.diagnostics
source: Xray remote egress diagnostics
ru: Диагностика удаленного выхода Xray

# diagnostics.xray_remote_egress.error.no_profile
source: Select a profile before running the remote egress probe.
ru: Выберите профиль перед проверкой удаленного выхода.

# diagnostics.xray_remote_egress.error.shared_container
source: Shared runtime storage is unavailable.
ru: Общее runtime-хранилище недоступно.

# diagnostics.xray_remote_egress.error.unsupported_protocol
source: Remote egress probe supports only Xray-backed profiles.
ru: Проверка удаленного выхода поддерживает только профили на Xray.

# diagnostics.xray_remote_egress.failed
source: Xray remote egress probe failed.
ru: Проверка удаленного выхода Xray не пройдена.

# diagnostics.xray_remote_egress.local_socks
source: Local SOCKS ready
ru: Локальный SOCKS готов

# diagnostics.xray_remote_egress.passed
source: Xray remote egress probe passed.
ru: Проверка удаленного выхода Xray пройдена.

# diagnostics.xray_remote_egress.payload_write
source: HTTP payload written
ru: HTTP payload отправлен

# diagnostics.xray_remote_egress.remote_attempted
source: Remote CONNECT attempted
ru: Удаленный CONNECT выполнен

# diagnostics.xray_remote_egress.remote_category
source: Remote probe category
ru: Категория удаленной проверки

# diagnostics.xray_remote_egress.remote_duration
source: Remote probe duration
ru: Длительность удаленной проверки

# diagnostics.xray_remote_egress.remote_egress
source: Remote egress succeeded
ru: Удаленный выход успешен

# diagnostics.xray_remote_egress.remote_first_byte
source: Remote first byte received
ru: Первый удаленный байт получен

# diagnostics.xray_remote_egress.remote_response
source: Remote HTTP response validated
ru: Удаленный HTTP-ответ проверен

# diagnostics.xray_remote_egress.remote_succeeded
source: Remote egress succeeded
ru: Удаленный выход успешен

# diagnostics.xray_remote_egress.run
source: Run Xray Remote Egress Probe
ru: Проверить удаленный выход Xray

# diagnostics.xray_remote_egress.socks_connect_accepted
source: SOCKS CONNECT accepted
ru: SOCKS CONNECT принят

# diagnostics.xray_remote_egress.socks_connect_requested
source: SOCKS CONNECT requested
ru: SOCKS CONNECT запрошен

# diagnostics.xray_remote_egress.testxray
source: testXray passed
ru: testXray пройден

# diagnostics.xray_remote_egress.warning
source: Starts Xray briefly, sends one SOCKS5 CONNECT, then writes a bounded IP-only HTTP request through Xray and validates the response prefix. No Tun2Socks or VPN routing is used.
ru: Кратко запускает Xray, отправляет один SOCKS5 CONNECT, затем ограниченный HTTP-запрос по IP через Xray и проверяет префикс ответа. Tun2Socks и VPN-маршрутизация не используются.

# diagnostics.xray_remote_egress.xray_running
source: Xray running
ru: Xray запущен

# diagnostics.xray_validation.builder
source: Xray builder
ru: Сборка Xray

# diagnostics.xray_validation.category
source: Category
ru: Категория

# diagnostics.xray_validation.diagnostics
source: Xray configuration diagnostics
ru: Диагностика конфигурации Xray

# diagnostics.xray_validation.duration
source: Duration
ru: Длительность

# diagnostics.xray_validation.error.no_profile
source: Select a supported Xray-backed profile before validating Xray configuration.
ru: Выберите поддерживаемый Xray-профиль перед проверкой конфигурации Xray.

# diagnostics.xray_validation.error.shared_container
source: Shared runtime storage is unavailable.
ru: Общее хранилище runtime недоступно.

# diagnostics.xray_validation.error.unsupported_protocol
source: This validation supports only Xray-backed K3B4 profiles.
ru: Эта проверка поддерживает только Xray-профили K3B4.

# diagnostics.xray_validation.extension_reached
source: Extension reached
ru: Расширение достигнуто

# diagnostics.xray_validation.failed
source: Xray configuration validation failed.
ru: Проверка конфигурации Xray не прошла.

# diagnostics.xray_validation.libxray_api
source: LibXray API
ru: API LibXray

# diagnostics.xray_validation.libxray_available
source: LibXray available
ru: LibXray доступен

# diagnostics.xray_validation.passed
source: Xray configuration validation passed.
ru: Проверка конфигурации Xray прошла.

# diagnostics.xray_validation.protocol
source: Protocol
ru: Протокол

# diagnostics.xray_validation.run
source: Validate Xray Configuration
ru: Проверить конфигурацию Xray

# diagnostics.xray_validation.runtime_config
source: Runtime configuration
ru: Runtime-конфигурация

# diagnostics.xray_validation.security
source: Security
ru: Защита

# diagnostics.xray_validation.stage
source: Stage
ru: Этап

# diagnostics.xray_validation.testxray_invoked
source: testXray invoked
ru: testXray вызван

# diagnostics.xray_validation.testxray_passed
source: Xray configuration accepted
ru: Конфигурация Xray принята

# diagnostics.xray_validation.transport
source: Transport
ru: Транспорт

# home.choose_server_or_profile
source: Choose a server or profile
ru: Выберите сервер или профиль

# home.connect
source: Connect
ru: Подключить

# home.current_connection
source: Current Connection
ru: Текущее подключение

# home.disconnect
source: Disconnect
ru: Отключить

# home.no_server_selected
source: No server selected
ru: Сервер не выбран

# home.not_tested
source: Not tested
ru: Не проверено

# home.stat.load
source: Load
ru: Нагрузка

# home.stat.mode
source: Mode
ru: Режим

# home.stat.ping
source: Ping
ru: Пинг

# home.status.connected
source: Connected
ru: Подключено

# home.status.connecting
source: Connecting
ru: Подключение

# home.status.disconnected
source: Disconnected
ru: Отключено

# home.status.disconnecting
source: Disconnecting
ru: Отключение

# home.status.failed
source: Failed
ru: Ошибка

# home.status.testing
source: Testing
ru: Проверка

# home.unknown
source: Unknown
ru: Неизвестно

# home.using_built_in_server
source: Using built-in server
ru: Используется встроенный сервер

# import.error.invalid_input
source: Invalid input
ru: Некорректные данные

# import.error.subscription_failed
source: Couldn’t add subscription
ru: Не удалось добавить подписку

# import.error.unsupported
source: Unsupported import content
ru: Неподдерживаемые данные для импорта

# import.progress.importing
source: Importing…
ru: Импортируем…

# import.success.multiple_profiles
source: Profiles added
ru: Профили добавлены

# import.success.profile
source: Profile added
ru: Профиль добавлен

# import.success.subscription
source: Subscription added
ru: Подписка добавлена

# import.success.title
source: Done
ru: Готово

# profiles.add
source: Add Profile
ru: Добавить профиль

# profiles.add.description
source: Choose how you want to add a VPN profile.
ru: Выберите способ добавления VPN-профиля.

# profiles.choose_qr_image
source: Choose QR Image
ru: Выбрать QR-изображение

# profiles.choose_qr_image.description
source: Import a QR code from Photos.
ru: Импортировать QR-код из Фото.

# profiles.continue_to_review
source: Continue to review profile
ru: Перейти к проверке профиля

# profiles.import_failed
source: Import Failed
ru: Не удалось импортировать

# profiles.import_file
source: Import File
ru: Импортировать файл

# profiles.import_file.description
source: Open a .txt, .conf, .json, .yaml or .yml file.
ru: Открыть файл .txt, .conf, .json, .yaml или .yml.

# profiles.manual_setup
source: Manual Setup
ru: Ручная настройка

# profiles.manual_setup.description
source: Enter server details yourself and save a draft.
ru: Введите параметры сервера вручную и сохраните черновик.

# profiles.paste_from_clipboard
source: Paste from Clipboard
ru: Вставить из буфера

# profiles.paste_link
source: Paste Link
ru: Вставить ссылку

# profiles.paste_link.description
source: Import a VPN link or save a subscription URL.
ru: Импортировать VPN-ссылку или сохранить URL подписки.

# profiles.profile_link
source: Profile link
ru: Ссылка профиля

# profiles.refresh
source: Refresh
ru: Обновить

# profiles.review_profile
source: Review Profile
ru: Проверка профиля

# profiles.scan_qr
source: Scan QR Code
ru: Сканировать QR-код

# profiles.scan_qr.description
source: Scan a QR code using the camera.
ru: Сканировать QR-код камерой.

# profiles.subscription
source: Add Subscription
ru: Добавить подписку

# profiles.subscription.description
source: Preview a provider link and save selected profiles.
ru: Проверить ссылку провайдера и сохранить выбранные профили.

# profiles.title
source: Profiles
ru: Профили

# profiles.use_profile
source: Use Profile
ru: Использовать профиль

# qr.camera_permission_required
source: Camera access is required to scan QR codes.
ru: Для сканирования QR-кодов нужен доступ к камере.

# qr.camera_unavailable
source: Camera unavailable
ru: Камера недоступна

# qr.camera_unavailable_description
source: Live QR scanning is unavailable on this device. Choose a QR image from Photos or paste a VPN link instead.
ru: Сканирование камерой недоступно на этом устройстве. Выберите QR-изображение из Фото или вставьте ссылку.

# qr.checking_camera
source: Checking camera access...
ru: Проверка доступа к камере...

source: QR Import Failed
ru: Не удалось импортировать QR-код

# qr.open_settings
source: Open Settings
ru: Открыть настройки

# qr.permission_denied_description
source: Enable camera access in Settings, choose a QR image from Photos, or paste a VPN link instead.
ru: Разрешите доступ к камере в настройках, выберите QR-изображение из Фото или вставьте ссылку.

# qr.permission_not_configured
source: Camera permission is not configured for this build. Choose a QR image from Photos or paste a VPN link instead.
ru: Разрешение камеры не настроено для этой сборки. Выберите QR-изображение из Фото или вставьте ссылку.

# qr.permission_restricted_description
source: Camera access is restricted on this device. Choose a QR image from Photos or paste a VPN link instead.
ru: Доступ к камере ограничен на этом устройстве. Выберите QR-изображение из Фото или вставьте ссылку.

# qr.please_wait
source: Please wait.
ru: Подождите.

# qr.title
source: Scan QR Code
ru: Сканировать QR-код

# settings.connection_engine
source: Connection Engine
ru: Движок подключения

# settings.language
source: Language
ru: Язык

# settings.language.system
source: System
ru: Системный

# settings.title
source: Settings
ru: Настройки

# tab.home
source: Home
ru: Главная

# vpn.demo_mode
source: Demo Mode — traffic is not routed through a VPN core.
ru: Демо-режим — трафик не проходит через VPN-ядро.

# vpn.traffic_not_protected
source: Traffic is not routed through a VPN core.
ru: Трафик не проходит через VPN-ядро.
